Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_choosing_between_the_maintenance_grant_and_back_to_education_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Case studies: Choosing between the student grant and Back to Education Allowance
ga: Cás-staidéir: Rogha a dhéanamh idir an deontas cothaithe agus an Liúntas um Fhilleadh ar an Oideachas

source: This case study looks at the choices available to people getting Jobseeker’s Allowance, One-Parent Family Payment and Disability Allowance
ga: Sa chás-staidéar seo breathnaítear ar na roghanna atá ar fáil do dhaoine a fhaigheann Liúntas do Lucht Cuardaigh Fostaíochta, Íocaíocht do Theaghlach Aon-Tuismitheora agus Liúntas Míchumais

source: Anne has been getting Jobseeker’s Allowance for 9 months and is starting a full-time course of further education at second level:
ga: Tá Liúntas do Lucht Cuardaigh Fostaíochta á fháil ag Anne le 9 mí anuas agus tá sí ag tosú ar chúrsa lánaimseartha breisoideachais ag an dara leibhéal:

source: Anne cannot get Jobseeker’s Allowance (JA) and attend full-time education
ga: Ní féidir le Anne Liúntas do Lucht Cuardaigh Fostaíochta (LLCF) a fháil agus freastal go lánaimseartha ar oideachas

source: She should apply for the Back to Education Allowance (BTEA)
ga: Ba cheart di cur isteach ar an Liúntas um Fhilleadh ar an Oideachas (LFO)

source: Her rate of payment on BTEA will be the same as the rate of Jobseeker’s Allowance she is getting and she can keep any secondary benefits she is currently getting
ga: Gheobhaidh sí an LFO ar an ráta céanna an Liúntais do Lucht Cuardaigh Fostaíochta agus féadfaidh sí aon sochar tánaisteach atá á fháil aici faoi láthair a choinneáil

source: She will not get the maintenance component of a student grant with BTEA, but she will be financially better off on BTEA than she would be on the maintenance grant alone
ga: Ní bhfaighidh sí deontas cothaithe mar aon le LFO, ach bheadh sí níos fearr as ó thaobh airgid de an LFO a fháil ná mar a bheadh sí ag fáil an deontais chothaithe amháin

source: Since Anne is doing a Post-Leaving Certificate (PLC) course and getting the BTEA she is exempt from the student participant charge (€200)
ga: Má tá cúrsa Iar-Ardteistiméireachta (PLC) á dhéanamh ag Anne, agus má tá an BTEA á fháil ag Anne, tá sí díolmhaithe ón muirear nua rannpháirtithe mac léinn (€200)

source: She may have to pay a course charge for books, exam fees and other costs
ga: B’fhéidir go gcaithfidh sí muirear cúrsa a íoc le haghaidh leabhar, táillí agus costais eile

source: If she was getting the BTEA for another type of course (for example, a third-level course) she would have to apply to SUSI to be assessed for the fee component of the student grant, covering the student contribution and any tuition fees/essential field trip costs
ga: Má fhaigheann sí an BTEA le haghaidh saghas cúrsa eile (mar shampla, cúrsa tríú leibhéal) beidh uirthi iarratas a dhéanamh chuig SUSI le fáil amach an bhfuil sí incháilithe don chomhábhar táillí an deontas mac léinn a áirítear ranníocaíocht na mac léinn agus táillí teagaisc/costas turas ríthábhachtach allamuigh

source: Peter has been getting a One-Parent Family Payment for 3 years and is starting a full-time course in higher education at third level:
ga: Tá Íocaíocht do Theaghlach Aon-Tuismitheora ag Peter le 3 bliana anuas agus tá sé ag tosú ar chúrsa lánaimseartha ardoideachais ag an tríú leibhéal:

source: Peter is getting a One-Parent Family Payment which means he has two options and will need to work out which will give him the higher income
ga: Tá Íocaíocht do Theaghlach Aon-Tuismitheora ag Peter, rud a chiallaíonn go bhfuil dhá rogha aige agus go gcaithfidh sé a dhéanamh amach cé acu a thabharfaidh an t-ioncam is airde dó

source: Peter can stay on his One-Parent Family Payment and get a student grant (both maintenance and fee components)
ga: Feadfaidh Peter an Íocaíocht do Theaghlach Aon-Tuismitheora atá á fáil aige a choinneáil agus deontas cothaithe a fháil

source: If he chooses this option he will continue to get his One-Parent Family Payment at his current rate as well as the grant
ga: Má roghnaíonn sé é sin a dhéanamh leanfaidh sé air ag fáil na hÍocaíochta do Theaghlach Aon-Tuismitheora ar an ráta reatha agus gheobhaidh sé an deontas cothaithe

source: However, he will lose any secondary benefits such as Rent Supplement
ga: Caillfidh sé aon sochar tánaisteach atá á fháil aige, áfach, mar Fhorlíonadh Cíosa nó Fhorlíonadh Ús Morgáiste

source: If he is nearing the end of his entitlement to One-Parent Family Payment, the Back to Education Allowance may be of greater benefit to him because it is paid for the duration of his course
ga: Más rud é go bhfuil sé ag teacht go deireadh a theidlíochta i leith na hÍocaíochta do Theaghlach Aon-Tuismitheora, ba thairbhí dó an Liúntas um Fhilleadh ar an Oideachas a bheith aige toisc go n-íocfar é sin ar feadh tréimhse a chúrsa

source: Peter can transfer from One-Parent Family Payment (OFP) to the Back to Education Allowance (BTEA)
ga: Féadfaidh Peter aistriú ón Íocaíocht do Theaghlach Aon-Tuismitheora atá á fáil aige go dtí an Liúntas um Fhilleadh ar an Oideachas (LFO)

source: If he chooses this option, he will not get the maintenance component of the student grant
ga: Má thograíonn sé é sin a dhéanamh, ní bhfaighidh sé deontas cothaithe

source: His rate of payment on BTEA will be the same as the rate of One-Parent Family Payment he was getting and he can keep any secondary benefits he is currently getting
ga: Gheobhaidh sé an LFO ar an ráta céanna na hÍocaíochta do Theaghlach Aon-Tuismitheora agus féadfaidh sé aon sochar tánaisteach atá á fháil aige faoi láthair a choinneáil

source: He must still apply to SUSI to be assessed for the fee component of the student grant, covering the student contribution and any tuition fees/essential field trip costs
ga: Beidh air iarratas a dhéanamh fós chuig SUSI, agus úsáid á baint as an bhfoirm i gcomhair deontas cothaithe, le fáil amach an bhfuil sé incháilithe an táille sheirbhísí mac léinn agus na táillí teagaisc a bheith íoctha dó

source: Maria has been getting a Disability Allowance for a number of years and is starting a full-time course in higher education at third level:
ga: Tá Liúntas Míchumais á fháil ag Maria le roinnt blianta anuas agus tá sí ag tosú ar chúrsa lánaimseartha ardoideachais ag an tríú leibhéal:

source: Maria is getting a Disability Allowance which means she has two options and will need to work out which will give her the higher income
ga: Tá Liúntas Míchumais á fháil ag Maria, rud a chiallaíonn go bhfuil dhá rogha aici agus go gcaithfidh sí a dhéanamh amach cé acu a thabharfaidh an t-ioncam is airde di

source: Maria can stay on Disability Allowance and get a student grant (both maintenance and fee components)
ga: Feadfaidh Maria an Liúntas Míchumais atá á fháil aici a choinneáil agus deontas cothaithe a fháil

source: If she chooses this option she will continue to get Disability Allowance at her current rate
ga: Má thograíonn sí é sin a dhéanamh leanfaidh sí uirthi ag fáil an Liúntais Mhíchumais ar a ráta reatha

source: However, she will lose any secondary benefits she is already getting such as Rent Supplement or Mortgage Interest Supplement
ga: Caillfidh sí aon sochar tánaisteach atá á fháil aici, áfach, mar Fhorlíonadh Cíosa nó Forlíonadh Ús Morgáiste

source: If she is living at home, her parents’ income may affect the amount of maintenance grant she will get
ga: D’fhéadfadh tionchar a bheith ag ioncam a tuismitheoirí ar mhéid an deontais chothaithe a gheobhaidh sí má tá sí ina cónaí sa bhaile

source: It may mean she will get a reduced amount of maintenance grant, or just the fee component of the student grant, or neither
ga: Mar gheall air sin, d’fhéadfadh sí deontas cothaithe laghdaithe a fháil, nó b’fhéidir nach bhfaigheadh sí ach íocaíocht na Táille Seirbhísí Mac Léinn, nó b’fhéidir nach bhfaigheadh sí ceachtar acu

source: She must notify the Disability Allowance Section in the Department of Social Protection that she is starting a course of study
ga: Caithfidh sí a chur in iúl don Rannóg Liúntais Mhíchumais sa Roinn Coimirce Sóisialaí go bhfuil sí ag tosú ar chúrsa staidéir

source: Maria can transfer from Disability Allowance (DA) to the Back to Education Allowance (BTEA)
ga: Féadfaidh Maria aistriú ón Liúntas Míchumais atá á fháil aici go dtí an Liúntas um Fhilleadh ar an Oideachas (LFO)

source: If she chooses this option and qualifies for BTEA she will not get the maintenance component of the student grant
ga: Má thograíonn sí é sin a dhéanamh agus má tá sí incháilithe chun an LFO a fháil ní bhfaighidh sí deontas cothaithe

source: Her rate of payment on BTEA will be the same as her rate of Disability Allowance and she can keep any secondary benefits she is currently getting
ga: Gheobhaidh sí an LFO ar an ráta céanna an Liúntais Mhíchumais agus féadfaidh sí aon sochar tánaisteach atá á fháil aici faoi láthair a choinneáil

source: She must still apply to SUSI to be assessed for the fee component of the student grant, covering the student contribution and any tuition fees/essential field trip costs
ga: Beidh uirthi iarratas a dhéanamh fós chuig SUSI, agus úsáid á baint as an bhfoirm i gcomhair deontas cothaithe, le fáil amach an bhfuil sí incháilithe chun táille sheirbhísí mac léinn agus chun na táillí teagaisc a bheith íoctha di
